feat: add visual diagrams
